<h1>Getting Started with Pandas</h1>

In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
import numpy as np

<h3>Introduction to Pandas Data Structures</h3>

<p><b>Series </b> - is a one dimensional array-like object containing a sequence of values and an associated array of data labels, called its index</p>

In [4]:
obj = pd.Series([4,7,-5,3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

<p>We can get the array representation and index objects of the Sereis via its 'values' and 'index' attributes respectively</p>

In [6]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

<p>Often it will be desirable to create a Series with an index identifying each data point</p>

In [8]:
obj2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

<p>We can use labels in the index when selecting single values or set of values </p>

In [11]:
obj2['a']

-5

In [12]:
obj2['d']

4

In [13]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [14]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [15]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [16]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

<p><b>Note: </b> Series can also be thought of as a fixed-length, ordered dict, as it is a mapping of index values to data values</p>

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

<p>Converting a Python dict obj to a Series obj in pandas<p>

In [19]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah' : 5000}

In [20]:
obj3 = pd.Series(sdata)

In [21]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

<p>When we pass only a dict, the index in the resulting Series will have the dict's keys in sorted order. We can override this by passing the dict keys in the order you want them to appear in the resulting Series.</p>

In [22]:
type(sdata)

dict

In [23]:
type(obj3)

pandas.core.series.Series

In [24]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [25]:
obj4 = pd.Series(sdata, index = states)

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

<p>Here, 3 values found in sdata were placed in the appropriate locations, but since no value for 'California' was found, it appears as NaN(not a number), which is considered in pads to mark missing or NA values.

In [27]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

<p>The 'isnull' and 'notnull' functions in pandas should be used to detect missing data. </p>

In [29]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [30]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [31]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [32]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

<p>Both the Series object itself and its index have a <b>'name'</b> attribute, which integrates with other key areas of pandas funcitonality</p>

In [33]:
obj4.name = 'population'

In [34]:
obj4.index.name = 'state'

In [35]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

<p>A series index can be altered in-place by assignment:</p>

In [36]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [37]:
obj.index = ['Bob', 'Seteve' ,'Jeff', 'Ryan']

In [38]:
obj

Bob       4
Seteve    7
Jeff     -5
Ryan      3
dtype: int64

<p><b>DataFrame:</b> A DataFrame represents a rectangular table of data and condtains an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.).The DataFrame has both a row and column index; it can be thought of as a dict of Series all sharing the same index.</p>

<p><b><i>Note: </i></b> While a DataFrame is physically two-dimensional, you can use it to represent higher dimensional data in a tabular formati using heirarchial indexing</p>

<p>There are many ways to create a DataFrame, though one of the most common is from a dict of equal-length lists or NumPy array: </p>

In [39]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000,2001,2002,2001,2002,2003],
       'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}

In [40]:
frame = pd.DataFrame(data)

In [41]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

<p>For Large DataFrames, the head method selects only the first five rows</p>

In [42]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

<p>If we specify a sequence of columns, the DataFrame's columns will be arranged in that order: </p>

In [43]:
pd.DataFrame(data,columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

<p>If passed a column that isn't contained in the dict, it will appear with the missing values in the result: </p>

In [44]:
frame2 = pd.DataFrame(data, columns = ['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])

In [45]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [46]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')


<p>We can retrive a column in a DataFrame as a Series either by dict-like  notation or by attribute: </p>

In [47]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [48]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

<p>Rows can also be retrieved by position or name with the special 'loc' attribute </p>

In [49]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [50]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

<p>Columns can be modified by assignment. For example, the empty 'debt' column could be assigned a scalar value or an array of values: </p>

In [51]:
frame2['debt'] = 16.5

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [53]:
frame2['debt'] = np.arange(6.)

In [54]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

<p>Note: When assigning lists or arrays to a column, we must make sure that the value's length must match the length of the DataFrame. If we assign a Series, its labels will be realigned exactly to the DataFrame's index, inserting missing values in any holes </p>

In [55]:
val = pd.Series([-1.2,-1.5,-1.7], index = ['two', 'four', 'five'])

In [56]:
frame2['debt'] = val

In [57]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

<p>Assinging a column thatt doesn't exist will create a new column. And the 'del' keyword wil delete columns as with a dict. </p>

In [58]:
frame2['eastern'] = (frame2.state == 'Ohio')

In [59]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [60]:
del frame2['eastern']

In [61]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [62]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

<b>Note:</b> The column returned from indexing a DataFrame is a view on the underlying data, not a copy. Thus, any in-place modifications to the Series will be reflected in the DataFrame. The column can be explicitely copied with the Series's copy method.

In [63]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio':{2000:1.5, 2001: 1.7, 2002: 3.6}}

If the nested dict is passed to the DataFrame, pandas will intrepret the outer dict keys as the columns and the inner dict keys as the rows indices

In [64]:
frame3 = pd.DataFrame(pop)

In [65]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

We can transpose the DataFrame with similar syntax as in Numpy array. Here, the tranposed dataframe will just be a copy and not a view.

In [66]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [67]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [68]:
pd.DataFrame(pop, index = [2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

The Dict of Sereis are treated in much the same way

In [69]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada':frame3['Nevada'][:2]}

In [70]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [71]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

If a DataFrame's index and columns have thier name attribtues set, these will also be displayed along with the frame

In [72]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [73]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

As with Series, the values attribute returns the data contained in the DataFrame as a two-dimensional ndarray

In [74]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [75]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

![alt Text](Images/Pandas/pd_df_constructor.png)

<h3>Index Objects</h3>

In [76]:
obj = pd.Series(range(3), index = ['a','b', 'c'])

In [77]:
index = obj.index

In [78]:
index

Index(['a', 'b', 'c'], dtype='object')

In [79]:
index[1:]

Index(['b', 'c'], dtype='object')

<b>Index objects are 'IMMUTABLE' and thus can't be modified by the user. Thus makes it safer to share Index objects among data structures.</b>

In [80]:
labels = pd.Index(np.arange(3))

In [81]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [82]:
obj2 = pd.Series([1.5, 2.5, 0],index = labels)

In [83]:
obj2

0    1.5
1    2.5
2    0.0
dtype: float64

In [84]:
obj2.index is labels

True

In [85]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

<b>Note</b> In addition to being array-like, an Index also behaves like a fixed size set

In [86]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [87]:
'Ohio' in frame3.columns

True

In [88]:
2003 in frame3.index

False

<b>Note: </b> Unlike python sets, a pandas Index can contain duplicate labels

In [89]:
dup_labels  = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [90]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

<b>But selections with duplicate labels will select all occurences of that label.</b>

Each Index has a numer of methods and properteis for set logic, which answer other common questions about the data it contains.

![alt Text](Images/Pandas/pd_index_methods.png)

<h3>Essential Functionality</h3>

<b>Reindexing</b> - An important method on pandas objects is reindex, which means to create a new object with the data conformed to a new index.

In [91]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])

In [92]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

Calling reindex on the above Series rearranges the data according to the new index, introducing missing values if any index values were not already present.

In [93]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [94]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

<b>Note: </b> For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing. The method option allows us to do this, using a method such as ffill, which forward-fills the values:

In [95]:
obj3  = pd.Series(['blue', 'purple', 'yellow'], index = [0,2,4])

In [96]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [97]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

<b>Note: </b> With DataFrame, reindex can alter either the (row) index, columns or both. When passed only a sequence, it reindexed the rows in the result

In [98]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index = ['a', 'c', 'd'],
                    columns = ['Ohio', 'Texas', 'California'])

In [99]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [100]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [101]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

The columns can be reindex with the column keyword

In [102]:
states = ['Texas', 'Utah', 'California']

In [103]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

<b>Note: </b> We can reindex more succinctly by lable-indexing withloc, and this way is more preferable by  many users.

![alt Text](Images/Pandas/pd_reindex.png)

<h3>Dropping Entries from an Axis</h3>

Dropping one or more entries from an axis is easy if you already have an index array or list without those entries. As that can require a bit of munging and set logic, the drop method will return a new object with the indicated value or values deleted from an axis

In [104]:
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c','d', 'e'])

In [105]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [106]:
new_obj = obj.drop('c')

In [107]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [108]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

With <b>DataFrame</b>, index values can be deleted from either axis.

In [109]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])

In [110]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Calling drop with a sequence of lables will drop values from the row labels(axis = 0)

In [111]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

We can drop values from the columns by passing axis = 1 or axis = 'columns'

In [112]:
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [113]:
data.drop('three', axis = 'columns')

          one  two  four
Ohio        0    1     3
Colorado    4    5     7
Utah        8    9    11
New York   12   13    15

Many functions like drop, which modify the size or shape of a Series or DataFrame, can manipulate an object in-place without returning a new object.

In [114]:
obj.drop('c', inplace=True)

In [115]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

<b>Note:</b> Be careful with the inplace, as it destroys any data that is dropped.

<h3>Indexing, Selection, and Filtering </h3>

Series indexing (obj[...]) works analogously to NumPy array indexing, except you can use the Series's index values instead of only integers.

In [116]:
obj = pd.Series(np.arange(4.), index=['a','b', 'c','d'])

In [117]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [118]:
obj['b']

1.0

In [120]:
obj[2]

2.0

In [121]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [122]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [123]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [124]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

Slicing with lables behaves differently than normal Python slicing in that the end-points are inclusive.

In [125]:
obj['b' : 'c']

b    1.0
c    2.0
dtype: float64

Setting using these methods modifies the corresponding section of the Series

In [126]:
obj['b':'c'] = 5

In [127]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

Indexing into a DataFrame is for retrieving one or more columns either with a single vlaue or sequence

In [128]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])

In [129]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [130]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [131]:
data [['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

Indexing like this has a few special cases. First, slicing or selecting data with a boolean array:

In [132]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [133]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The row selection syntax data[:2] is provided as a convenience. Passing a single element or a list to the [] operator selects columns.

Another use case is in indexing with a boolean DataFrame, such as one produced by a scalar comparision

In [134]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [135]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [136]:
data[data<5] = 0

In [137]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

This makes DataFrame syntactically more like a two-dimensional NumPy array in this particular case.

<h3> Selection with loc and iloc </h3>

In [138]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The special indexing operators loc and iloc enables us to select a subset of rows and columns from a DataFrame with NumPy-like notation using either axis labels(loc) or integers (iloc)

In [143]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [144]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [145]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [146]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

Both indexing functions work with slices in addition to single labels or list of labels

In [147]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [149]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [151]:
data.iloc[:, :3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [152]:
data.iloc[:, :3][data['three'] > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

![alt Text](Images/Pandas/pd_indexing_options.png)

![alt Text](Images/Pandas/pd_indexing_options2.png)

<h3>Integer Indexes</h3>

In [165]:
ser = pd.Series(np.arange(3.))

In [166]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [162]:
ser2 = pd.Series(np.arange(3.), index = ['a', 'b', 'c'])

In [163]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [164]:
ser2[-1]

2.0

In [168]:
ser[:1]

0    0.0
dtype: float64

In [169]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [170]:
ser.iloc[:1]

0    0.0
dtype: float64

<h3>Arithmetic and Data Alignment</h3>

An important pandas feature for some applications is the behavior of arithmetic between objects with different indexes. When you are adding together objects, if any index pairs are not the same, the respective index in the result will be the union of the index paris. For users with database experience, this is similar to an automatic <b>Outer Join</b> on the index labels.

In [171]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index = ['a', 'c', 'd', 'e'])

In [172]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])

In [173]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [174]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [175]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

Here, the internal data alignment introduces missing values in the label locations that don't overlap. Missing values will then propagate in further arithmetic computations.

In case of DataFrame, alignment is performed on both the rows and the columns

In [176]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),
                  columns = list('bcd'), 
                  index = ['Ohio', 'Texas', 'Colorado'])

In [178]:
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                  columns = list('bde'),
                  index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [179]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [180]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

Adding these together returns a DataFrame whose index and columns are the unionis of the ones in each DataFrame

In [181]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

Since, the 'c' and 'e' columns are note present in bothe the DataFrame objects, they appears as all missing in the result. The same holds for the 'Utah', 'Colorado', and 'Oregon' whose labels are not common to both objects.

<b>Note: </b> If you add DataFrame objects with no column or row labels in common, then the result will contain all nulls:

In [182]:
df1 = pd.DataFrame({'A': [1,2]})

In [183]:
df2 = pd.DataFrame({'B' : [3,4]})

In [184]:
df1

   A
0  1
1  2

In [185]:
df2

   B
0  3
1  4

In [186]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

<h3>Arithmetic methods with fill values </h3>

In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis lable is found in one object but not the other

In [187]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                  columns = list('abcd'))

In [189]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), 
                  columns=list('abcde'))

In [190]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [191]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [195]:
df2.loc[1, 'b'] = np.nan

In [196]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [197]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [198]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

Using the add method on df1,we can pass df2 and an arguemnt to fill_value

In [199]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [200]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [201]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [202]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

When reindxing a Series or DataFrame, we can speciy a different fill value

In [203]:
df1.reindex(columns = df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

![alt Text](Images/Pandas/pd_flexible_arithmetic.png)

<h3>Operations between DataFrame and Series</h3>

In [204]:
arr = np.arange(12.).reshape((3,4))

In [205]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [206]:
arr[0]

array([0., 1., 2., 3.])

In [207]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

Here, when we subtract arr[0] from arr, the subtraction is performed once for each row. This is referred to as broadcasting.

In [208]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                    columns = list('bde'),
                    index = ['Utah', 'Ohio', 'Teas', 'Oregon'])

In [209]:
series = frame.iloc[0]

In [210]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Teas    6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [211]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

By default, arithmetic between a DataFrame and Series matches the index of the Series on the DataFrame's columns, broadcasting down the rows

In [212]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Teas    6.0  6.0  6.0
Oregon  9.0  9.0  9.0

If an idex value is not found in either the DataFrame's columns or the Series's index, then the objects will be reindexed to form the union

In [213]:
series2 = pd.Series(range(3), index = ['b', 'e', 'f'])

In [214]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Teas    6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

If we want to instead broadcast over the columns, matching on the rows, we have to use one of the arithmetic methods

In [215]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Teas    6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [216]:
series3 = frame['d']

In [217]:
series3

Utah       1.0
Ohio       4.0
Teas       7.0
Oregon    10.0
Name: d, dtype: float64

In [218]:
frame.sub(series3, axis = 'index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Teas   -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

The axis number that we pass is the axis to mathc on. In this case we mean to match on the DataFrame's row index (axis='index' or axis= 0) and broadcast across the columns.

<h3>Function Application and Mapping </h3>

Numpy ufuncs (element-wise array methods) also work with pandas objects

In [219]:
frame = pd.DataFrame(np.random.randn(4,3), 
                    columns = list('bde'),
                    index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [220]:
frame

               b         d         e
Utah    0.850620 -0.715972 -0.986745
Ohio   -0.469395 -1.630932 -0.044315
Texas   0.016019 -0.502609 -1.330998
Oregon  1.355763  1.121585  0.924379

In [221]:
np.abs(frame)

               b         d         e
Utah    0.850620  0.715972  0.986745
Ohio    0.469395  1.630932  0.044315
Texas   0.016019  0.502609  1.330998
Oregon  1.355763  1.121585  0.924379

Another frequent operation is applying a function on one-dimensional arrays to each column or row. DataFrame's apply method does exactly this.

In [231]:
f = lambda x: x.max() - x.min()

In [232]:
frame.apply(f)

b    1.825159
d    2.752517
e    2.255377
dtype: float64

Here, the function f, which computes the difference between the maximum and minimum of a Series, is invoked once on each column in frame. The result is a Series having the columns of frame as its index.

If we pass axis = 'columns' to apply, the function will be invoked once per row instead

In [236]:
frame.apply(f, axis = 'columns')

Utah      1.837365
Ohio      1.586617
Texas     1.347017
Oregon    0.431384
dtype: float64

Many of the most common array statistics (like sum and mean) are DataFrame methods so using apply is not necessary.

The function passed to apply need not return a scalar value, it can also return a Series with multiple values

In [242]:
def f(x):
    return pd.Series([x.min(),x.max()],
                    index = ['min', 'max'])

In [243]:
frame.apply(f)

            b         d         e
min -0.469395 -1.630932 -1.330998
max  1.355763  1.121585  0.924379

Element wise python functions can be used, too. Suppose, you wanted to compute a formatted string from each floating-point value in frame. You can do this with apply

In [244]:
format = lambda x: '%2f' % x

In [245]:
frame.applymap(format)

                b          d          e
Utah     0.850620  -0.715972  -0.986745
Ohio    -0.469395  -1.630932  -0.044315
Texas    0.016019  -0.502609  -1.330998
Oregon   1.355763   1.121585   0.924379

The reason for the name applymap is that Series has a map method for applying an element-wise function

In [246]:
frame['e'].map(format)

Utah      -0.986745
Ohio      -0.044315
Texas     -1.330998
Oregon     0.924379
Name: e, dtype: object

<h3>Sorting and Ranking</h3>

Sorting a dataset by some criterion is another important built-in operation. To sort lexicographically by row or column index, use the sort_index method, which returns a new, sorted object

In [247]:
obj = pd.Series(range(4), index = ['d', 'a','b','c'])

In [248]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [249]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

With a DataFrame, we can sort by index on either axis

In [252]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index = ['three', 'one'],
                    columns = ['d', 'a', 'b', 'c'])

In [253]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [254]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [255]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [256]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

The data is sorted in ascending order by default, but can be sorted in descending order too using the ascending attribute

In [257]:
frame.sort_index(axis = 1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series by its values, use it's sort_values method

In [258]:
obj = pd.Series([4,7,-3,2])

In [259]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default

In [260]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [261]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

When sorting a DataFrame, we can use the data in one or more columns as the sort keys.To do so, pass one or more columns names to the by option of sort_values

In [262]:
frame = pd.DataFrame({'b': [4,7,-3,2,], 'a': [0,1,0,1]})

In [263]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [264]:
frame.sort_values(by='a')

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

To sort by multiple columns, pass a list of name

In [265]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array. The rank methods for Series and DataFrame are the place to look; by default rank breaks ties by assinging each group the mean rank

In [266]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [267]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ranks can also be assigned according to the order in which they're observed in the data

In [268]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

Here, instead of using the average rank 6.5 for the entries 0 and 2, they instead have been set ot 6 and 7 because label 0 precedes label 2 in the data.

We can rank in descending order too

In [269]:
obj.rank(ascending=False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

DataFrame can compute ranks over the rows or the columns

In [273]:
frame = pd.DataFrame({'b': [4.3, 7, -3,2], 'a': [0,1,0,1],
                     'c': [-2,5,8,-2.5]})

In [274]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [275]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

![alt Text](Images/Pandas/pd_rank.png)

<h3>Axis Indexes with Duplicate Labels </h3>

In [276]:
obj = pd.Series(range(5), index = ['a', 'a', 'b','b', 'c'])

In [277]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

The index's is_unique property can tell you whether its labels are unique or not

In [279]:
obj.index.is_unique

False

Data Selection is one of the main things that behaves differently with duplicates. Indexing a label with multiple entries returns a Series, while single entries return a scalar value

In [280]:
obj['a']

a    0
a    1
dtype: int64

In [281]:
obj['c']

4

This can make our code more complicated as the output type from indexing can vary based on whether a label is repeated or not.

In [282]:
df = pd.DataFrame(np.random.randn(4,3), 
                 index = ['a', 'a', 'b', 'b'])

In [283]:
df

          0         1         2
a  1.031766 -0.193402 -0.792162
a -1.667154  0.491666  0.880743
b -1.368850 -0.589609  1.029847
b  0.266792  0.222425  1.771233

In [284]:
df.index.is_unique

False

In [285]:
df.loc['b']

          0         1         2
b -1.368850 -0.589609  1.029847
b  0.266792  0.222425  1.771233

<h3>Summarizing and Computing Descriptive Statistics</h3>

In [286]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],
                 index = ['a', 'b', 'c', 'd'],
                 columns = ['one', 'two'])

In [287]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

Calling DataFrame's sum method returns a Series containing Column Sums

In [288]:
df.sum()

one    9.25
two   -5.80
dtype: float64

Passing axis = 'columns' or axis = 1 sums across the columsn instead

In [289]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

NA values are excluded unless the entire slice (row or column in this case) is NA. This can be disabled with the skipna option

In [291]:
df.mean(axis='columns', skipna= False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

![alt Text](Images/Pandas/pd_reduction.png)

Some methods likek idxmin and idxmax return indirect statistics like the index value where the minimum or maximum values are attained

In [292]:
df.idxmax()

one    b
two    d
dtype: object

Other methods are accumulations

In [293]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

Another type of method is neither a reduction nor an accumulatoin. <b>describe</b>is one such example, producing multiple summary statistics in one shot.

In [294]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

On non-numeric data, describe produces alternative summary statistics

In [295]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [296]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

![alt Text](Images/Pandas/pd_descriptive_stats.png)

<h3>Unique Values, Value Counts, and Membership</h3>

In [301]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [303]:
uniques = obj.unique()

In [304]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

The unique values are not necessarily returned in sorted order, but could be sorted after the fact if needed (uniques.sort()). Relatedly, value_counts computes a Series containing value frequencies

In [305]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

The Series is sorted by value in descending order as a convenience. But it can be sorted in ascending order as well by setting the attribute of sort value to False

In [306]:
pd.value_counts(obj.values, sort = False)

a    3
b    2
d    1
c    3
dtype: int64

isin performs a vectorized set memebership check and can be useful in filtering a dataset down to a subset of values in a Series or column in a Dataframe

In [307]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [308]:
mask = obj.isin(['b', 'c'])

In [309]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [310]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

Related to isin is the Index.get_indexer method, which gives us an index array from an array of possibly non-distinct values into another array of distinct values

In [311]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [312]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [313]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

![alt Text](Images/Pandas/pd_unique_val_count.png)

In some cases, we may want to compute a histogram on multiple related columns in a DataFrame.

In [314]:
data = pd.DataFrame({'Qu1': [1,3,4,3,4],
                    'Qu2': [2,3,1,2,3],
                    'Qu3': [1,5,2,4,4]})

In [315]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [316]:
result = data.apply(pd.value_counts).fillnaa(0)

In [317]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0